In [1]:
#dependencies

import pandas as pd

In [2]:
#Use Pandas to read data
avocado_sales_2016 = pd.read_csv("../Resources/clean_avocado.csv")

In [3]:
#print to view
avocado_sales_2016.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
1,1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,Albany
2,2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,Albany
3,3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,Albany
4,4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,Albany

In [4]:
#look for missing values
#awesome to see!
avocado_sales_2016.count()

Unnamed: 0      18722
Date            18722
AveragePrice    18722
Total Volume    18722
4046            18722
4225            18722
4770            18722
Total Bags      18722
Small Bags      18722
Large Bags      18722
XLarge Bags     18722
type            18722
year            18722
region          18722
dtype: int64

In [5]:
#get a list of all of our columns for easy reference
avocado_sales_2016.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [6]:
#collect data that includes year 2016 - all cities
#'year' == 2016

avocado_sales_2016_df = avocado_sales_2016.loc[(avocado_sales_2016["year"] == 2016)]

In [7]:
#print
avocado_sales_2016_df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
52,52,1/4/2016,1.03,149038.15,939.71,139735.90,132.35,8230.19,8056.43,173.76,0.0,conventional,2016,Albany
53,53,1/10/2016,1.28,79121.77,848.19,66696.97,109.08,11467.53,11293.65,173.88,0.0,conventional,2016,Albany
54,54,1/17/2016,1.26,119972.41,1202.52,100613.46,51.22,18105.21,17980.53,124.68,0.0,conventional,2016,Albany
55,55,1/24/2016,1.22,96089.13,545.37,70802.56,68.41,24672.79,23926.35,746.44,0.0,conventional,2016,Albany
56,56,1/31/2016,1.16,102038.32,1386.24,79881.67,69.46,20700.95,19788.78,912.17,0.0,conventional,2016,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18568,26411,11/27/2016,1.47,4523.75,283.60,34.68,0.00,4205.47,2350.00,1855.47,0.0,organic,2016,Tampa
18569,26412,12/4/2016,1.45,4668.39,306.82,50.00,0.00,4311.57,2263.33,2048.24,0.0,organic,2016,Tampa
18570,26413,12/11/2016,1.37,5795.54,317.18,16.63,0.00,5461.73,3273.33,2188.40,0.0,organic,2016,Tampa
18571,26414,12/18/2016,1.22,6281.56,317.02,46.96,0.00,5917.58,3796.67,2120.91,0.0,organic,2016,Tampa
18572,26415,12/25/2016,1.21,6117.58,254.26,25.30,0.00,5838.02,3800.00,2038.02,0.0,organic,2016,Tampa

In [8]:
#drop column "Unnamed: 0"
#add at end inplace=True -> to allow panda to edit the original DF
avocado_sales_2016_df.drop(columns=["Unnamed: 0"], inplace=True)

In [9]:
#print to view
avocado_sales_2016_df

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
52,1/4/2016,1.03,149038.15,939.71,139735.90,132.35,8230.19,8056.43,173.76,0.0,conventional,2016,Albany
53,1/10/2016,1.28,79121.77,848.19,66696.97,109.08,11467.53,11293.65,173.88,0.0,conventional,2016,Albany
54,1/17/2016,1.26,119972.41,1202.52,100613.46,51.22,18105.21,17980.53,124.68,0.0,conventional,2016,Albany
55,1/24/2016,1.22,96089.13,545.37,70802.56,68.41,24672.79,23926.35,746.44,0.0,conventional,2016,Albany
56,1/31/2016,1.16,102038.32,1386.24,79881.67,69.46,20700.95,19788.78,912.17,0.0,conventional,2016,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18568,11/27/2016,1.47,4523.75,283.60,34.68,0.00,4205.47,2350.00,1855.47,0.0,organic,2016,Tampa
18569,12/4/2016,1.45,4668.39,306.82,50.00,0.00,4311.57,2263.33,2048.24,0.0,organic,2016,Tampa
18570,12/11/2016,1.37,5795.54,317.18,16.63,0.00,5461.73,3273.33,2188.40,0.0,organic,2016,Tampa
18571,12/18/2016,1.22,6281.56,317.02,46.96,0.00,5917.58,3796.67,2120.91,0.0,organic,2016,Tampa
18572,12/25/2016,1.21,6117.58,254.26,25.30,0.00,5838.02,3800.00,2038.02,0.0,organic,2016,Tampa

In [10]:
#export DF into a .csv
avocado_sales_2016_df.to_csv("avocado_sales_2016.csv")